diverger/uboot-lpc32xx/include/lpc3250.h
/***********************************************************************
 *
 * Copyright (C) 2008 by NXP Semiconductors
 * All rights reserved.
 *
 * @Author: Kevin Wells
 * @Descr: Definitions for LPC3250 chip
 * @References: NXP LPC3250 User's Guide
 *
 * This program is free software; you can redistribute it and/or
 * modify it under the terms of the GNU General Public License as
 * published by the Free Software Foundation; either version 2 of
 * the License, or (at your option) any later version.
 *
 * This program is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
 * GNU General Public License for more details.
 *
 * You should have received a copy of the GNU General Public License
 * along with this program; if not, write to the Free Software
 * Foundation, Inc., 59 Temple Place, Suite 330, Boston,
 * MA 02111-1307 USA
 *
 ***********************************************************************/

#ifndef __LPC3250_H
#define __LPC3250_H

/*
 * AHB physical address bases used in u-boot
 */
#define SSP0_BASE       0x20084000 	/* SSP0 registers base */
#define MLC_BASE	0x200A8000	/* MLC NAND Flash registers base*/
#define ETHERNET_BASE	0x31060000	/* Ethernet ctrl register base*/
#define EMC_BASE        0x31080000 	/* EMC registers base*/
#define SLC_BASE	0x20020000	/* SLC NAND Flash registers base*/
#define SD_BASE		0x20098000	/* SD card interface registers base*/
#define DMA_BASE	0x31000000	/* DMA controller registers base*/
#define USB_OTG_BASE	0x31020000	/*USB OTG registers base*/
#define OTG_I2C_BASE	0x31020300	/*USB I2C registers base*/

/*
 * FAB physical address bases used in u-boot
 */
#define TIMER0_BASE     0x40044000
#define TIMER1_BASE     0x4004C000
#define CLK_PM_BASE	0x40004000	/* System control registers base*/
#define WDTIM_BASE	0x4003C000	/* Watchdog timer registers base*/
#define UART_CTRL_BASE	0x40054000	/* general UART ctrl regs base*/
#define GPIO_BASE	0x40028000	/* GPIO registers base*/

/*
 * APB physical address bases used in u-boot
 */
#define UART3_BASE	0x40080000	/* UART 3 registers base*/
#define UART4_BASE	0x40088000	/* UART 4 registers base*/
#define UART5_BASE	0x40090000	/* UART 5 registers base*/
#define UART6_BASE	0x40098000	/* UART 6 registers base*/

/*
 * Internal memory physical address bases used in u-boot
 */
#define IRAM_BASE       0x08000000  	/* Internal RAM address */

/*
 * External Static Memory Bank Address Space physical address bases
 */
#define EMC_CS0_BASE	0xE0000000
#define EMC_CS1_BASE	0xE1000000
#define EMC_CS2_BASE	0xE2000000
#define EMC_CS3_BASE	0xE3000000

/*
 * External SDRAM Memory Bank Address Space Bases
 */
#define EMC_DYCS0_BASE	0x80000000  	/* SDRAM DYCS0 base address */
#define EMC_DYCS1_BASE	0xA0000000  	/* SDRAM DYCS1 base address */

/*
 * Clock and crystal information
 */
#define MAIN_OSC_FREQ	13000000
#define CLOCK_OSC_FREQ	32768

/* bit position macro */
#define _BIT(n)		(0x1 << (n))

#define _SBF(f,v) (((unsigned long)(v)) << (f))

/*
 * Standard UART register structures
 */
typedef struct
{
	volatile unsigned int dll_fifo;     /* UART data FIFO/holding/dll reg */
	volatile unsigned int dlm_ier;      /* UART high divisor/int enable reg */
	volatile unsigned int iir_fcr;      /* UART int pending/FIFO contrl reg */
	volatile unsigned int lcr;          /* UART line control reg */
	volatile unsigned int modem_ctrl;   /* UART modem control reg */
	volatile unsigned int lsr;          /* UART line status reg */
	volatile unsigned int modem_status; /* UART modem status reg */
	volatile unsigned int rxlev;        /* UART RX FIFO level reg */
} UART_REGS_T;

/*
 * UART control structure
 */
typedef struct
{
	volatile unsigned int ctrl;         /* General UART control register */
	volatile unsigned int clkmode;      /* UART clock control register */
	volatile unsigned int loop;         /* UART loopmode enable/disable */
} UART_CNTL_REGS_T;

/*
 * UART dll and dlm register definitions
 */
#define UART_LOAD_DM(div)          ((div) & 0xFF)

/*
 * UART ier register definitions
 */
/* Bit for enabling the modem status interrupt */
#define UART_IER_MODEM_STS         _BIT(3)
/* Bit for enabling the RX line status interrupt(s) */
#define UART_IER_RXLINE_STS        _BIT(2)
/* Bit for enabling the transmit holding register empty interrupt */
#define UART_IER_THRE              _BIT(1)
/* Bit for enabling the receive data available (RDA) interrupt */
#define UART_IER_RDA               _BIT(0)

/*
 * UART iir register definitions
 */
/* Bit for masking interrupt pending status */
#define UART_IIR_INT_PENDING       _BIT(0)
/* Mask for getting interrupt source */
#define UART_IIR_INT_MASK          0xE
/* Interrupt sources */
#define UART_IIR_MODEM_STS         0x0
#define UART_IIR_INTSRC_THRE       0x2
#define UART_IIR_INTSRC_RDA        0x4
#define UART_IIR_INTSRC_RXLINE     0x6
#define UART_IIR_INTSRC_CTI        0xC /* Character timeout */
/* Interrupt bits mask word */
#define UART_IIR_INTSRC_MASK       0xE

/*
 * UART fcr register definitions
 */
/* Receive FIFO trigger level selections */
#define UART_FCR_RXFIFO_TL16       0x0
#define UART_FCR_RXFIFO_TL32       _BIT(6)
#define UART_FCR_RXFIFO_TL48       _BIT(7)
#define UART_FCR_RXFIFO_TL60       (_BIT(7) | _BIT(6))
/* Transmit FIFO trigger level selections */
#define UART_FCR_TXFIFO_TL0        0x0
#define UART_FCR_TXFIFO_TL4        _BIT(4)
#define UART_FCR_TXFIFO_TL8        _BIT(5)
#define UART_FCR_TXFIFO_TL16       (_BIT(5) | _BIT(4))
/* Enable FIFO bit - must be set with UART_FCR_FIFO_EN */
#define UART_FCR_FIFO_CTRL         _BIT(3)
/* Clear TX FIFO bit */
#define UART_FCR_TXFIFO_FLUSH      _BIT(2)
/* Clear RX FIFO bit */
#define UART_FCR_RXFIFO_FLUSH      _BIT(1)
/* Enable FIFO bit - must be set with UART_FCR_FIFO_CTRL */
#define UART_FCR_FIFO_EN           _BIT(0)

