diverger/uboot-lpc32xx/include/lpc3250.h
/*
 * UART lcr register definitions
 */
/* Bit for enabling divisor latch and IER register */
#define UART_LCR_DIVLATCH_EN       _BIT(7)
/* Bit for enabling break transmission (forces TX low) */
#define UART_LCR_BREAK_EN          _BIT(6)
/* Parity selection */
#define UART_LCR_PARITY_ODD        0x0
#define UART_LCR_PARITY_EVEN       _BIT(4)
#define UART_LCR_PARITY_FORCE1     _BIT(5)
#define UART_LCR_PARITY_FORCE0     (_BIT(5) | _BIT(4))
/* Parity selection mask */
#define UART_LCR_PARITY_MASK       (_BIT(5) | _BIT(4))
/* Parity enable bit */
#define UART_LCR_PARITY_ENABLE     _BIT(3)
/* Stop bit selection */
#define UART_LCR_STOP1BIT          0x0
#define UART_LCR_STOP2BITS         _BIT(2)
/* Word length selections */
#define UART_LCR_WLEN_5BITS        0x0
#define UART_LCR_WLEN_6BITS        _BIT(0)
#define UART_LCR_WLEN_7BITS        _BIT(1)
#define UART_LCR_WLEN_8BITS        (_BIT(1) | _BIT(0))
/* Word length mask */
#define UART_LCR_WLEN_MASK         (_BIT(1) | _BIT(0))

/*
 * UART modem_ctrl register definitions
 */
/* Bit for enabling modem loopback mode */
#define UART_MDMC_LOOPB_EN         _BIT(4)
/* Bit for driving RTS low */
#define UART_MDMC_RTS_LOW          _BIT(1)
/* Bit for driving DTR low */
#define UART_MDMC_DTR_LOW          _BIT(0)

/*
 * UART lsr register definitions
 */
/* Bit for masking FIFO RX error status */
#define UART_LSR_FIFORX_ERR        _BIT(7)
/* Bit for masking transmitter empty status */
#define UART_LSR_TEMT              _BIT(6)
/* Bit for masking transmit FIFO trip point status */
#define UART_LSR_THRE              _BIT(5)
/* Bit for masking break interrupt status */
#define UART_LSR_BI                _BIT(4)
/* Bit for masking framing error status */
#define UART_LSR_FR                _BIT(3)
/* Bit for masking parity error status */
#define UART_LSR_PE                _BIT(2)
/* Bit for masking RX FIFO overrun error status */
#define UART_LSR_OE                _BIT(1)
/* Bit for masking RX FIFO empty status */
#define UART_LSR_RDR               _BIT(0)

/*
 * UART modem_status register definitions
 */
/* Bit for masking data carrier detect state */
#define UART_MDMS_DCD              _BIT(7)
/* Bit for masking ring indicator state */
#define UART_MDMS_RI               _BIT(6)
/* Bit for masking data set ready state */
#define UART_MDMS_DSR              _BIT(5)
/* Bit for masking clear to send state */
#define UART_MDMS_CTS              _BIT(4)
/* Bit for detecting state change on DCD */
#define UART_MDMS_DCD_CHG          _BIT(3)
/* Bit for detecting state change on RI */
#define UART_MDMS_RI_CHG           _BIT(2)
/* Bit for detecting state change on DSR */
#define UART_MDMS_DSR_CHG          _BIT(1)
/* Bit for detecting state change on CTS */
#define UART_MDMS_CTS_CHG          _BIT(0)

/*
 * UART rxlev register definitions
 */
/* Macro for masking off the receive FIFO level */
#define UART_RXLEV(n)              ((n) & 0x7F)

/*
 * UART ctrl register definitions
*/
/* UART3 modem control pin enable bit */
#define UART_U3_MD_CTRL_EN         _BIT(11)
/* IRRX6 inversion enable bit */
#define UART_IRRX6_INV_EN          _BIT(10)
/* IRRX6 RX mask while TX enabled enable bit */
#define UART_HDPX_EN               _BIT(9)
/* UART6 IRA modulator bypass bit */
#define UART_UART6_IRDAMOD_BYPASS  _BIT(5)
/* IRTX6 inversion enable bit */
#define RT_IRTX6_INV_EN            _BIT(4)
/* IRRX6 inversion enable bit */
#define RT_IRTX6_INV_MIR_EN        _BIT(3)
/* IR RX length, 3/16th pulse length with a 115Kbps clock */
#define RT_RX_IRPULSE_3_16_115K    _BIT(2)
/* IR TX length, 3/16th pulse length with a 115Kbps clock */
#define RT_TX_IRPULSE_3_16_115K    _BIT(1)
/* UART5 mirror route to the USB D+ and D- pins bit */
#define UART_U5_ROUTE_TO_USB       _BIT(0)

/*
 * UART clkmode register definitions
 */
/* Macro return the UART clock enabled field, shifted */
#define UART_ENABLED_CLOCKS(n)     (((n) >> 16) & 0x7F)
/* Macro returning a selected enabled UART clock bit */
#define UART_ENABLED_CLOCK(n, u)   (((n) >> (16 + (u))) & 0x1)
/* Bit that indicates if any UARTS are being clocked */
#define UART_ENABLED_CLKS_ANY      _BIT(14)
/* Defnies for setting a IARTs clock mode */
#define UART_CLKMODE_OFF           0x0    /* Clocks are off */
#define UART_CLKMODE_ON            0x1    /* Clocks are on */
#define UART_CLKMODE_AUTO          0x2    /* Clocks are automatic */
/* Clock mode mask for a UART, for UARTs 6 to 3 only */
#define UART_CLKMODE_MASK(u)      (0x3 << ((((u) - 3) * 2) + 4))
/* Macro for loading a UARTs clock mode, for UARTs 6 to 3 only */
#define UART_CLKMODE_LOAD(m, u)   ((m) << ((((u) - 3) * 2) + 4))

/*
 * Macros pointing to UART base and control registers
 */
#define UART3 ((UART_REGS_T *)(UART3_BASE))
#define UART4 ((UART_REGS_T *)(UART4_BASE))
#define UART5 ((UART_REGS_T *)(UART5_BASE))
#define UART6 ((UART_REGS_T *)(UART6_BASE))
#define UARTCNTL ((UART_CNTL_REGS_T *) (UART_CTRL_BASE))












/**********************************************************************
* Clock and Power control register structures
**********************************************************************/

/*
 * Clock and Power control module register structure
 */
typedef struct
{
  volatile unsigned int reserved1 [5];
  volatile unsigned int clkpwr_bootmap;
  volatile unsigned int clkpwr_p01_er;
  volatile unsigned int clkpwr_usbclk_pdiv;
  volatile unsigned int clkpwr_int_er;
  volatile unsigned int clkpwr_int_rs;
  volatile unsigned int clkpwr_int_sr;
  volatile unsigned int clkpwr_int_ap;
  volatile unsigned int clkpwr_pin_er;
  volatile unsigned int clkpwr_pin_rs;
  volatile unsigned int clkpwr_pin_sr;
  volatile unsigned int clkpwr_pin_ap;
  volatile unsigned int clkpwr_hclk_div;
  volatile unsigned int clkpwr_pwr_ctrl;
  volatile unsigned int clkpwr_pll397_ctrl;
  volatile unsigned int clkpwr_main_osc_ctrl;
  volatile unsigned int clkpwr_sysclk_ctrl;
  volatile unsigned int clkpwr_lcdclk_ctrl;
  volatile unsigned int clkpwr_hclkpll_ctrl;
  volatile unsigned int reserved2;
  volatile unsigned int clkpwr_adc_clk_ctrl_1;
  volatile unsigned int clkpwr_usb_ctrl;
  volatile unsigned int clkpwr_sdramclk_ctrl;
  volatile unsigned int clkpwr_ddr_lap_nom;
  volatile unsigned int clkpwr_ddr_lap_count;
  volatile unsigned int clkpwr_ddr_cal_delay;
  volatile unsigned int clkpwr_ssp_blk_ctrl;
  volatile unsigned int clkpwr_i2s_clk_ctrl;
  volatile unsigned int clkpwr_ms_ctrl;
  volatile unsigned int reserved4 [3];
  volatile unsigned int clkpwr_macclk_ctrl;
  volatile unsigned int reserved5 [4];
  volatile unsigned int clkpwr_test_clk_sel;
  volatile unsigned int clkpwr_sw_int;
  volatile unsigned int clkpwr_i2c_clk_ctrl;
  volatile unsigned int clkpwr_key_clk_ctrl;
  volatile unsigned int clkpwr_adc_clk_ctrl;
  volatile unsigned int clkpwr_pwm_clk_ctrl;
  volatile unsigned int clkpwr_timer_clk_ctrl;
  volatile unsigned int clkpwr_timers_pwms_clk_ctrl_1;
  volatile unsigned int clkpwr_spi_clk_ctrl;
  volatile unsigned int clkpwr_nand_clk_ctrl;
  volatile unsigned int reserved7;
  volatile unsigned int clkpwr_uart3_clk_ctrl;
  volatile unsigned int clkpwr_uart4_clk_ctrl;
  volatile unsigned int clkpwr_uart5_clk_ctrl;
  volatile unsigned int clkpwr_uart6_clk_ctrl;
  volatile unsigned int clkpwr_irda_clk_ctrl;
  volatile unsigned int clkpwr_uart_clk_ctrl;
  volatile unsigned int clkpwr_dmaclk_ctrl;
  volatile unsigned int clkpwr_autoclock;
} CLKPWR_REGS_T;


