diverger/uboot-lpc32xx/include/lpc3250.h
/*
 * Macro pointing to Clock and Power control registers
 */
#define CLKPWR ((CLKPWR_REGS_T *)(CLK_PM_BASE))

/*
 * Main system clocks
 */
typedef enum
{
  /* Main oscillator clock */
  CLKPWR_MAINOSC_CLK,
  /* RTC clock */
  CLKPWR_RTC_CLK,
  /* System clock (Main oscillator or PLL397) */
  CLKPWR_SYSCLK,
  /* ARM clock, either HCLK(PLL), SYSCLK, or PERIPH_CLK */
  CLKPWR_ARM_CLK,
  /* HCLK (HCLKPLL divided, SYSCLK, or PERIPH_CLK) */
  CLKPWR_HCLK,
  /* Peripheral clock (HCLKPLL divided or SYSCLK) */
  CLKPWR_PERIPH_CLK,
  /* USB HCLK SYS*/
  CLKPWR_USB_HCLK_SYS,
  /* USB PLL clock */
  CLKPWR_48M_CLK,
  /* DDR clock (HCLKPLL divided or SYSCLK) */
  CLKPWR_DDR_CLK,
  /* Sd card controller */
  CLKPWR_MSSD_CLK,
  CLKPWR_BASE_INVALID
} CLKPWR_BASE_CLOCK_T;

/*
 * Clock rate fetch function
 */
unsigned int sys_get_rate(CLKPWR_BASE_CLOCK_T clkid);





/**********************************************************************
* Timer/counter register structures
**********************************************************************/

/* Timer module register structures */
typedef struct
{
  volatile unsigned int ir;          /* Timer interrupt status reg */
  volatile unsigned int tcr;         /* Timer control register */
  volatile unsigned int tc;          /* Timer counter value reg */
  volatile unsigned int pr;          /* Timer prescale register */
  volatile unsigned int pc;          /* Timer prescale counter reg */
  volatile unsigned int mcr;         /* Timer Match control reg */
  volatile unsigned int mr[4];       /* Timer Match registers */
  volatile unsigned int ccr;         /* Timer Capture control reg */
  volatile unsigned int cr[4];       /* Timer Capture registers */
  volatile unsigned int emr;         /* Timer External match reg */
  volatile unsigned int rsvd2[12];   /* Reserved */
  volatile unsigned int ctcr;        /* Timer Count control reg */
} TIMER_CNTR_REGS_T;

/**********************************************************************
* ir register definitions
* Write a '1' to clear interrupt, reading a '1' indicates active int
**********************************************************************/
/* Macro for getting a timer match interrupt bit */
#define TIMER_CNTR_MTCH_BIT(n)     (1 << ((n) & 0x3))

/* Macro for getting a capture event interrupt bit */
#define TIMER_CNTR_CAPT_BIT(n)     (1 << (4 + ((n) & 0x3)))

/**********************************************************************
* tcr register definitions
**********************************************************************/
/* Timer/counter enable bit */
#define TIMER_CNTR_TCR_EN          0x1

/* Timer/counter reset bit */
#define TIMER_CNTR_TCR_RESET       0x2

/**********************************************************************
* mcr register definitions
**********************************************************************/
/* Bit location for interrupt on MRx match, n = 0 to 3 */
#define TIMER_CNTR_MCR_MTCH(n)     (0x1 << ((n) * 3))

/* Bit location for reset on MRx match, n = 0 to 3 */
#define TIMER_CNTR_MCR_RESET(n)    (0x1 << (((n) * 3) + 1))

/* Bit location for stop on MRx match, n = 0 to 3 */
#define TIMER_CNTR_MCR_STOP(n)     (0x1 << (((n) * 3) + 2))

/**********************************************************************
* ccr register definitions
**********************************************************************/
/* Bit location for CAP.n on CRx rising edge, n = 0 to 3 */
#define TIMER_CNTR_CCR_CAPNRE(n)   (0x1 << ((n) * 3))

/* Bit location for CAP.n on CRx falling edge, n = 0 to 3 */
#define TIMER_CNTR_CCR_CAPNFE(n)   (0x1 << (((n) * 3) + 1))

/* Bit location for CAP.n on CRx interrupt enable, n = 0 to 3 */
#define TIMER_CNTR_CCR_CAPNI(n)    (0x1 << (((n) * 3) + 2))

/**********************************************************************
* emr register definitions
**********************************************************************/
/* Bit location for output state change of MAT.n when external match
   happens, n = 0 to 3 */
#define TIMER_CNTR_EMR_DRIVE(n)    (1 << (n))

/* Macro for setting MAT.n soutput state */
#define TIMER_CNTR_EMR_DRIVE_SET(n, s) (((s) & 0x1) << (n))

/* Output state change of MAT.n when external match happens */
#define TIMER_CNTR_EMR_NOTHING     0x0
#define TIMER_CNTR_EMR_LOW         0x1
#define TIMER_CNTR_EMR_HIGH        0x2
#define TIMER_CNTR_EMR_TOGGLE      0x3

/* Macro for setting for the MAT.n change state bits */
#define TIMER_CNTR_EMR_EMC_SET(n, s) (((s) & 0x3) << (4 + ((n) * 2)))

/* Mask for the MAT.n change state bits */
#define TIMER_CNTR_EMR_EMC_MASK(n) (0x3 << (4 + ((n) * 2)))

/**********************************************************************
* ctcr register definitions
**********************************************************************/
/* Mask to get the Counter/timer mode bits */
#define TIMER_CNTR_CTCR_MODE_MASK  0x3

/* Mask to get the count input select bits */
#define TIMER_CNTR_CTCR_INPUT_MASK 0xC

/* Counter/timer modes */
#define TIMER_CNTR_CTCR_TIMER_MODE 0x0
#define TIMER_CNTR_CTCR_TCINC_MODE 0x1
#define TIMER_CNTR_CTCR_TCDEC_MODE 0x2
#define TIMER_CNTR_CTCR_TCBOTH_MODE 0x3

/* Count input selections */
#define TIMER_CNTR_CTCR_INPUT_CAP0 0x0
#define TIMER_CNTR_CTCR_INPUT_CAP1 0x1
#define TIMER_CNTR_CTCR_INPUT_CAP2 0x2
#define TIMER_CNTR_CTCR_INPUT_CAP3 0x3

/* Macro for setting the counter/timer mode */
#define TIMER_CNTR_SET_MODE(n)     ((n) & 0x3)

/* Macro for setting the count input select */
#define TIMER_CNTR_SET_INPUT(n)    (((n) & 0x3) << 2)

/* Macros pointing to timer registers */
#define TIMER_CNTR0 ((TIMER_CNTR_REGS_T *)(TIMER0_BASE))
#define TIMER_CNTR1 ((TIMER_CNTR_REGS_T *)(TIMER1_BASE))
#define TIMER_CNTR2 ((TIMER_CNTR_REGS_T *)(TIMER2_BASE))
#define TIMER_CNTR3 ((TIMER_CNTR_REGS_T *)(TIMER3_BASE))





/* WDT module register structures */
typedef struct
{
  volatile unsigned int wdtim_int;      /* WDT interrupt status register */
  volatile unsigned int wdtim_ctrl;     /* WDT control register */
  volatile unsigned int wdtim_counter;  /* WDT counter value register */
  volatile unsigned int wdtim_mctrl;    /* WDT match control register */
  volatile unsigned int wdtim_match0;   /* WDT match 0 register */
  volatile unsigned int wdtim_emr;      /* WDT external match control reg */
  volatile unsigned int wdtim_pulse;    /* WDT reset pulse length register */
  volatile unsigned int wdtim_res;      /* WDT reset source register */
} WDT_REGS_T;

/**********************************************************************
* wdtim_int register definitions
**********************************************************************/
/* Interrupt flag for MATCH 0 interrupt */
#define WDT_MATCH_INT           _BIT(0)

/**********************************************************************
* wdtim_ctrl register definitions
**********************************************************************/
#define WDT_COUNT_ENAB          _BIT(0) /* Timer Counter enable */
#define WDT_RESET_COUNT         _BIT(1) /* Timer Counter reset */
#define WDT_PAUSE_EN            _BIT(2) /* Timer Cntr stopped in debug*/

/**********************************************************************
* wdtim_mctrl register definitions
**********************************************************************/
#define WDT_MR0_INT             _BIT(0) /* Enable WDT int on MR0 */
#define WDT_RESET_COUNT0        _BIT(1) /* Enable WDT reset on MR0 */
#define WDT_STOP_COUNT0         _BIT(2) /* Enable WDT stop on MR0 */
#define WDT_M_RES1              _BIT(3) /* M_RES1 control */
#define WDT_M_RES2              _BIT(4) /* M_RES2 control */
#define WDT_RESFRC1             _BIT(5) /* RESFRC1 control */
#define WDT_RESFRC2             _BIT(6) /* RESFRC2 control */

/* Macro pointing to WDT registers */
#define WDT ((WDT_REGS_T *)(WDTIM_BASE))



/* SLC NAND controller module register structures */
typedef struct
{
  volatile unsigned int slc_data;      /* SLC NAND data reg */
  volatile unsigned int slc_addr;      /* SLC NAND address register */
  volatile unsigned int slc_cmd;       /* SLC NAND command reg */
  volatile unsigned int slc_stop;      /* SLC NAND stop register */
  volatile unsigned int slc_ctrl;      /* SLC NAND control reg */
  volatile unsigned int slc_cfg;       /* SLC NAND config register */
  volatile unsigned int slc_stat;      /* SLC NAND status register */
  volatile unsigned int slc_int_stat;  /* SLC NAND int status register */
  volatile unsigned int slc_ien;       /* SLC NAND int enable register */
  volatile unsigned int slc_isr;       /* SLC NAND int set register */
  volatile unsigned int slc_icr;       /* SLC NAND int clear register */
  volatile unsigned int slc_tac;       /* SLC NAND timing register */
  volatile unsigned int slc_tc;        /* SLC NAND transfer count reg */
  volatile unsigned int slc_ecc;       /* SLC NAND parity register */
  volatile unsigned int slc_dma_data;  /* SLC NAND DMA data register */
} SLCNAND_REGS_T;

/**********************************************************************
* slc_ctrl register definitions
**********************************************************************/
#define SLCCTRL_SW_RESET    _BIT(2) /* Reset the NAND controller bit */
#define SLCCTRL_ECC_CLEAR   _BIT(1) /* Reset ECC bit */
#define SLCCTRL_DMA_START   _BIT(0) /* Start DMA channel bit */

/**********************************************************************
* slc_cfg register definitions
**********************************************************************/
#define SLCCFG_CE_LOW       _BIT(5) /* Force CE low bit */
#define SLCCFG_DMA_ECC      _BIT(4) /* Enable DMA ECC bit */
#define SLCCFG_ECC_EN       _BIT(3) /* ECC enable bit */
#define SLCCFG_DMA_BURST    _BIT(2) /* DMA burst bit */
#define SLCCFG_DMA_DIR      _BIT(1) /* DMA write(0)/read(1) bit */
#define SLCCFG_WIDTH        _BIT(0) /* External device width, 0=8bit */

/**********************************************************************
* slc_stat register definitions
**********************************************************************/
#define SLCSTAT_DMA_FIFO    _BIT(2) /* DMA FIFO has data bit */
#define SLCSTAT_SLC_FIFO    _BIT(1) /* SLC FIFO has data bit */
#define SLCSTAT_NAND_READY  _BIT(0) /* NAND device is ready bit */

/**********************************************************************
* slc_int_stat, slc_ien, slc_isr, and slc_icr register definitions
**********************************************************************/
#define SLCSTAT_INT_TC      _BIT(1) /* Transfer count bit */
#define SLCSTAT_INT_RDY_EN  _BIT(0) /* Ready interrupt bit */

/**********************************************************************
* slc_tac register definitions
**********************************************************************/
/* Clock setting for RDY write sample wait time in 2*n clocks */
#define SLCTAC_WDR(n)       (((n) & 0xF) << 28)
/* Write pulse width in clocks cycles, 1 to 16 clocks */
#define SLCTAC_WWIDTH(n)    (((n) & 0xF) << 24)
/* Write hold time of control and data signals, 1 to 16 clocks */
#define SLCTAC_WHOLD(n)     (((n) & 0xF) << 20)
/* Write setup time of control and data signals, 1 to 16 clocks */
#define SLCTAC_WSETUP(n)    (((n) & 0xF) << 16)
/* Clock setting for RDY read sample wait time in 2*n clocks */
#define SLCTAC_RDR(n)       (((n) & 0xF) << 12)
/* Read pulse width in clocks cycles, 1 to 16 clocks */
#define SLCTAC_RWIDTH(n)    (((n) & 0xF) << 8)
/* Read hold time of control and data signals, 1 to 16 clocks */
#define SLCTAC_RHOLD(n)     (((n) & 0xF) << 4)
/* Read setup time of control and data signals, 1 to 16 clocks */
#define SLCTAC_RSETUP(n)    (((n) & 0xF) << 0)

/* Macro pointing to SLC NAND controller registers */
#define SLCNAND ((SLCNAND_REGS_T *)(SLC_BASE))











/**********************************************************************
* Ethernet MAC controller register structures
**********************************************************************/

/* Ethernet MAC controller module register structures */
typedef struct
{
  /* MAC registers */
  volatile unsigned long mac1;
  volatile unsigned long mac2;
  volatile unsigned long ipgt;
  volatile unsigned long ipgr;
  volatile unsigned long clrt;
  volatile unsigned long maxf;
  volatile unsigned long supp;
  volatile unsigned long test;
  volatile unsigned long mcfg;
  volatile unsigned long mcmd;
  volatile unsigned long madr;
  volatile unsigned long mwtd;
  volatile unsigned long mrdd;
  volatile unsigned long mind;
  volatile unsigned long reserved1 [2];
  volatile unsigned long sa [3];
  volatile unsigned long reserved2 [45];
  /* Control registers */
  volatile unsigned long command;
  volatile unsigned long status;
  volatile unsigned long rxdescriptor;
  volatile unsigned long rxstatus;
  volatile unsigned long rxdescriptornumber;
  volatile unsigned long rxproduceindex;
  volatile unsigned long rxconsumeindex;
  volatile unsigned long txdescriptor;
  volatile unsigned long txstatus;
  volatile unsigned long txdescriptornumber;
  volatile unsigned long txproduceindex;
  volatile unsigned long txconsumeindex;
  volatile unsigned long reserved3 [10];
  volatile unsigned long tsv0;
  volatile unsigned long tsv1;
  volatile unsigned long rsv;
  volatile unsigned long reserved4 [3];
  volatile unsigned long flowcontrolcounter;
  volatile unsigned long flowcontrolstatus;
  volatile unsigned long reserved5 [34];
  /* RX filter registers */
  volatile unsigned long rxfliterctrl;
  volatile unsigned long rxfilterwolstatus;
  volatile unsigned long rxfilterwolclear;
  volatile unsigned long reserved6;
  volatile unsigned long hashfilterL;
  volatile unsigned long hashfilterh;
  volatile unsigned long reserved7 [882];
  /* Module control registers */
  volatile unsigned long intstatus;
  volatile unsigned long intenable;
  volatile unsigned long intclear;
  volatile unsigned long Intset;
  volatile unsigned long reserved8;
  volatile unsigned long powerdown;
  volatile unsigned long reserved9;
} ETHERNET_REGS_T;

