diverger/uboot-lpc32xx/include/lpc3250.h
/* Following macro is used to determine bit position for a P0 GPIO pin
   used with the p0_xxx registers for pins P0_0 to P0_7*/
#define OUTP_STATE_GPIO_P0(pin)	  _BIT((pin))

/* P0 pin mux defines (0 = GPIO, 1 = alternate function) */
#define P0_GPOP0_I2SRXCLK1		  _BIT(0)
#define P0_GPOP1_I2SRXWS1	      _BIT(1)
#define P0_GPOP2_I2SRXSDA0	      _BIT(2)
#define P0_GPOP3_I2SRXCLK0	      _BIT(3)
#define P0_GPOP4_I2SRXWS0	      _BIT(4)
#define P0_GPOP5_I2STXSDA0	      _BIT(5)
#define P0_GPOP6_I2STXCLK0	      _BIT(6)
#define P0_GPOP7_I2STXWS0	      _BIT(7)
#define P0_ALL						0xFF

/***********************************************************************
* p1_mux_set, p1_mux_clr, p1_mux_state register defines
**********************************************************************/

/* Following macro is used to determine bit position for a P1 GPIO pin
   used with the p1_xxx registers for pins P1_0 to P1_23*/
#define OUTP_STATE_GPIO_P1(pin)	  _BIT((pin))

/* Mask for all GPIO P1 bits */
#define P1_ALL                    0x00FFFFFF

/* Macro pointing to GPIO registers */
#define GPIO  ((GPIO_REGS_T *)(GPIO_BASE))

/***********************************************************************
* p2_mux_set, p2_mux_clr, p2_mux_state register defines
**********************************************************************/
/* Muxed PIO#2 pin state defines */
#define P2_GPIO05_SSEL0			_BIT(5)
#define P2_GPIO04_SSEL1			_BIT(4)
#define P2_SDRAMD19D31_GPIO		_BIT(3)
#define P2_GPO21_U4TX	        _BIT(2)
#define P2_GPIO03_KEYROW7		_BIT(1)
#define P2_GPIO02_KEYROW6		_BIT(0)

/***********************************************************************
* p3_mux_set, p3_mux_clr, p3_mux_state register defines
**********************************************************************/
/* Muxed PIO#3 pin states, first column is '0' state, second is '1' */
#define P3_GPO2_MAT10          _BIT(2)
#define P3_GPO6_PWM43          _BIT(6)
#define P3_GPO8_PWM42          _BIT(8)
#define P3_GPO9_PWM41          _BIT(9)
#define P3_GPO10_PWM36         _BIT(10)
#define P3_GPO12_PWM35         _BIT(12)
#define P3_GPO13_PWM34         _BIT(13)
#define P3_GPO15_PWM33         _BIT(15)
#define P3_GPO16_PWM32         _BIT(16)
#define P3_GPO18_PWM31         _BIT(18)

typedef struct
{
  volatile unsigned int baud_rate;
  volatile unsigned int cts_en;
  volatile unsigned int cts_inv;
  volatile unsigned int rts_en;
  volatile unsigned int rts_inv;
} HSUART_CONTROL_T;

typedef struct
{
  volatile unsigned int txrx_fifo;
  volatile unsigned int level;
  volatile unsigned int iir;
  volatile unsigned int ctrl;
  volatile unsigned int rate;
} HSUART_REGS_T;

typedef struct
{
  volatile unsigned int ctrl;
  volatile unsigned int clkmode;
  volatile unsigned int loop;
} HSUART_CNTL_REGS_T;

#define UART1 ((HSUART_REGS_T *)(HS_UART1_BASE))
#define UART2 ((HSUART_REGS_T *)(HS_UART2_BASE))
#define UART7 ((HSUART_REGS_T *)(HS_UART7_BASE))

#define HS_UART1_BASE 0x40014000
#define HS_UART2_BASE 0x40018000
#define HS_UART7_BASE 0x4001C000

/**********************************************************************
* OTG I2C controller register structures
**********************************************************************/

/* OTG I2C controller module register structures */
typedef struct
{
  volatile unsigned long otg_i2c_txrx;      /* OTG I2C Tx/Rx Data FIFO */
  volatile unsigned long otg_i2c_stat;      /* OTG I2C Status Register */
  volatile unsigned long otg_i2c_ctrl;      /* OTG I2C Control Register */
  volatile unsigned long otg_i2c_clk_hi;    /* OTG I2C Clock Divider high */
  volatile unsigned long otg_i2c_clk_lo;    /* OTG I2C Clock Divider low */
} OTGI2C_REGS_T;

/**********************************************************************
* OTG controller register structures
**********************************************************************/

/* OTG controller module register structures */
typedef struct
{
  volatile unsigned long reserved1[64];
  volatile unsigned long otg_int_sts;      /* OTG int status register */
  volatile unsigned long otg_int_enab;     /* OTG int enable register */
  volatile unsigned long otg_int_set;      /* OTG int set register */
  volatile unsigned long otg_int_clr;      /* OTG int clear register */
  volatile unsigned long otg_sts_ctrl;     /* OTG status/control register */
  volatile unsigned long otg_timer;        /* OTG timer register */
  volatile unsigned long reserved2[122];
  OTGI2C_REGS_T otg_i2c;
  volatile unsigned long reserved3[824];
  volatile unsigned long otg_clk_ctrl;      /* OTG clock control reg */
  volatile unsigned long otg_clk_sts;       /* OTG clock status reg */
} OTG_REGS_T;

/**********************************************************************
* otg_int_sts, otg_int_enab, otg_int_set, and otg_int_clr register
* definitions
**********************************************************************/
#define OTG_INT_HNP_SUCC _BIT(3)       /* HNP success */
#define OTG_INT_HNP_FAIL _BIT(2)       /* HNP failure */
#define OTG_INT_REM_PLLUP _BIT(1)      /* Remove pullup interrupt */
#define OTG_INT_TIMER _BIT(0)          /* Timer interrupt */

/**********************************************************************
* otg_sts_ctrl register definitions
**********************************************************************/
#define OTG_PLLUP_REMD _BIT(10)        /* Pullup removed */
#define OTG_AB_HNP_TRK _BIT(9)         /* A to B HNP track */
#define OTG_BA_HNP_TRK _BIT(8)         /* B to A HNP track */
#define OTGTRAN_I2C_EN _BIT(7)         /* Enable transparent I2C */
#define OTG_TIMER_RST _BIT(6)          /* Reset the timer */
#define OTG_TIMER_EN _BIT(5)           /* Enable the timer */
#define OTG_TIMER_MODE_FREE _BIT(4)    /* Enable freerun timer mode */
#define OTG_TIMER_GRAN_10US 0x0        /* 10uS timer granularity */
#define OTG_TIMER_GRAN_100US 0x4       /* 100uS timer granularity */
#define OTG_TIMER_GRAN_1000US 0x8      /* 1000uS timer granularity */
#define OTG_HOST_EN _BIT(0)            /* Enable host mode */

/**********************************************************************
* OTG I2C register definitions
* The register definitions are exactly the same as "master only" base
* I2C register settings. See the I2C header file for the register
* bit descriptions for this peripheral.
**********************************************************************/

/**********************************************************************
* otg_clk_ctrl and otg_clk_sts register definitions
**********************************************************************/
#define OTG_CLK_AHB_EN _BIT(4)         /* Enable AHB clock */
#define OTG_CLK_OTG_EN _BIT(3)         /* Enable OTG clock */
#define OTG_CLK_I2C_EN _BIT(2)         /* Enable I2C clock */
#define OTG_CLK_DEV_EN _BIT(1)         /* Enable device clock */
#define OTG_CLK_HOST_EN _BIT(0)        /* Enable host clock */

