diverger/uboot-lpc32xx/include/lpc3250.h
/* Macro pointing to I2C controller registers */
#define OTG     ((OTG_REGS_T  *)(USB_OTG_BASE))
/* Macro pointing to I2C controller registers */
#define OTGI2C  ((OTGI2C_REGS_T  *)(OTG_I2C_BASE))


/**********************************************************************
* I2C controller register structures
**********************************************************************/


/**********************************************************************
* i2c_txrx register definitions
**********************************************************************/
#define I2C_START    _BIT(8)		/* generate a START before this B*/
#define I2C_STOP     _BIT(9)		/* generate a STOP after this B */

/**********************************************************************
* i2c_stat register definitions
**********************************************************************/
#define I2C_TDI     _BIT(0)         /* Transaction Done Interrupt */
#define I2C_AFI     _BIT(1)         /* Arbitration Failure Interrupt */
#define I2C_NAI     _BIT(2)         /* No Acknowledge Interrupt */
#define I2C_DRMI    _BIT(3)         /* Master Data Request Interrupt */
#define I2C_DRSI    _BIT(4)         /* Slave Data Request Interrupt */
#define I2C_ACTIVE  _BIT(5)         /* Busy bus indicator */
#define I2C_SCL     _BIT(6)         /* The current SCL signal value */
#define I2C_SDA     _BIT(7)         /* The current SDA signal value */
#define I2C_RFF     _BIT(8)         /* Receive FIFO Full */
#define I2C_RFE     _BIT(9)         /* Receive FIFO Empty */
#define I2C_TFF     _BIT(10)        /* Transmit FIFO Full */
#define I2C_TFE     _BIT(11)        /* Transmit FIFO Empty */
#define I2C_TFFS    _BIT(12)        /* Slave Transmit FIFO Full */
#define I2C_TFES    _BIT(13)        /* Slave Transmit FIFO Empty */

/**********************************************************************
* i2c_ctrl register definitions
**********************************************************************/
#define I2C_TDIE    _BIT(0)         /* Transaction Done Int Enable */
#define I2C_AFIE    _BIT(1)         /* Arbitration Failure Int Ena */
#define I2C_NAIE    _BIT(2)         /* No Acknowledge Int Enable */
#define I2C_DRMIE   _BIT(3)         /* Master Data Request Int Ena */
#define I2C_DRSIE   _BIT(4)         /* Slave Data Request Int Ena */
#define I2C_RFFIE   _BIT(5)         /* Receive FIFO Full Int Ena */
#define I2C_RFDAIE  _BIT(6)         /* Rcv Data Available Int Ena */
#define I2C_TFFIE   _BIT(7)         /* Trnsmt FIFO Not Full Int Ena */
#define I2C_RESET   _BIT(8)         /* Soft Reset */
#define I2C_SEVEN   _BIT(9)         /* Seven-bit slave address */
#define I2C_TFFSIE  _BIT(10)        /* Slave Trnsmt FIFO Not Full IE */

/**********************************************************************
* External Memory Controller register definitions
**********************************************************************/
/* Static chip select configuration structure */
typedef struct
{
  volatile unsigned int emcstaticconfig;
  volatile unsigned int emcstaticwaitwen;
  volatile unsigned int emcstaticwait0en;
  volatile unsigned int emcstaticwaitrd;
  volatile unsigned int emcstaticpage;
  volatile unsigned int emcstaticwr;
  volatile unsigned int emcstaticturn;
  volatile unsigned int reserved;
} EMC_STATIC_CFG;

/*  AHB control structure */
typedef struct
{
  volatile unsigned int emcahbcontrol;
  volatile unsigned int emcahbstatus;
  volatile unsigned int emcahbtimeout;
  volatile unsigned int reserved [5];
} EMC_AHB_CTRL_T;

typedef struct
{
  volatile unsigned int emccontrol;
  volatile unsigned int emcstatus;
  volatile unsigned int emcconfig;
  volatile unsigned int reserved1 [5];
  volatile unsigned int emcdynamiccontrol;
  volatile unsigned int emcdynamicrefresh;
  volatile unsigned int emcdynamicreadconfig;
  volatile unsigned int reserved2;
  volatile unsigned int emcdynamictrp;
  volatile unsigned int emcdynamictras;
  volatile unsigned int emcdynamictsrex;
  volatile unsigned int reserved3 [2];
  volatile unsigned int emcdynamictwr;
  volatile unsigned int emcdynamictrc;
  volatile unsigned int emcdynamictrfc;
  volatile unsigned int emcdynamictxsr;
  volatile unsigned int emcdynamictrrd;
  volatile unsigned int emcdynamictmrd;
  volatile unsigned int emcdynamictcdlr;
  volatile unsigned int reserved4 [8];
  volatile unsigned int emcstaticextendedwait;
  volatile unsigned int reserved5 [31];
  volatile unsigned int emcdynamicconfig0;
  volatile unsigned int emcdynamicrascas0;
  volatile unsigned int reserved6 [6];
  volatile unsigned int emcdynamicconfig1;
  volatile unsigned int emcdynamicrascas1;
  volatile unsigned int reserved7 [54];
  EMC_STATIC_CFG  emcstatic_regs [4];
  volatile unsigned int reserved8 [96];
  EMC_AHB_CTRL_T  emcahn_regs [5];
} EMC_REGS_T;

/* Macro pointing to EMC registers */
#define EMC  ((EMC_REGS_T *)(EMC_BASE))

#endif /* __LPC3250_H */

